<?php

return [
    'general'      => 'Основные',
    'create'       => 'Новая запись',
    'edit'         => 'Редактировать',
    'restore'      => 'Востановить',
    'show'         => 'Смотреть',
    'delete'       => 'Удалить',
    'close'        => 'Закрыть',
    'export'       => 'Export',
    'selectDelete' => 'Удалить отмеченные',
    'clickDelete'  => 'Вы уверены, что хотите удалить эту запись?',
    'showSimilar'  => 'Показать подобные записи',
    'selectFilter' => '-- выберите фильтр --',
];